#+BEGIN_COMMENT
.. title: Data Generators
.. slug: data-generators
.. date: 2020-12-23 12:50:22 UTC-08:00
.. tags: nlp,data
.. category: NLP
.. link: 
.. description: Data Generators in python.
.. type: text

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 3
#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-57dc56d4-cb08-4639-807e-c62e80b0a435-ssh.json
#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC
** An Example of a Circular List
   This is sort of a fake generator that uses indices to make it look like it's infinite.

#+begin_src python :results output :exports both
a = [1, 2, 3, 4]
a_size = len(a)
end = 10
index = 0                      # similar to index in data_generator below
for i in range(10):        # `b` is longer than `a` forcing a wrap   
    print(a[index], end=",")
    index = (index + 1) % a_size    
#+end_src

#+RESULTS:
: 1,2,3,4,1,2,3,4,1,2,

There's a python built-in that's equivalent to this called [[https://docs.python.org/3/library/itertools.html#itertools.cycle][cycle]].

#+begin_src python :results output :exports both
index = 1
for item in cycle(a):
    print(item, end=",")
    if index == end:
        break
    index += 1    
#+end_src

#+RESULTS:
: 1,2,3,4,1,2,3,4,1,2,

And if you wanted to make your own generator version you could use the yield keyword.

#+begin_src python :results output :exports both
def infinite(a: list):
    """Generates elements infinitely

    Args:
     a: list

    Yields:
     elements of a
    """
    index = 0
    end = len(a)
    while True:
        yield a[index]
        index = (index + 1) % end
    return

a_infinite = infinite(a)
for index, item in enumerate(a_infinite):
    if index == end:
        break
    print(item, end=",")
#+end_src

#+RESULTS:
: 1,2,3,4,1,2,3,4,1,2,
** Shuffling the data order

 In the next example, we will do the same as before, but shuffling the order of the elements in the output list. Note that here, our strategy of traversing using =lines_index= and =index= becomes very important, because we can simulate a shuffle in the input data, without doing that in reality.

#+begin_src python :results output :exports both 
a = tuple((1, 2, 3, 4))
a_size = len(a)
data_indices = list(range(a_size))
print(f"Original order of indices: {data_indices}")
#+end_src

#+RESULTS:
: Original order of indices: [0, 1, 2, 3]

If we shuffle the index_list we can change the order of our circular list without modifying the order or our original data.

#+begin_src python :results output :exports both
random.shuffle(data_indices) # Shuffle the order
print(f"Shuffled order of indices: {data_indices}")
#+end_src

#+RESULTS:
: Shuffled order of indices: [3, 0, 1, 2]

Now we create a list of random values from a that is larger than a.

#+begin_src python :results output :exports both
b = [a[index] for index in data_indices]
b_size = 10

print(f"New value order for first batch: {b}")
batch_counter = 1
data_index = 0
for b_index in range(len(b), b_size):
    if data_index == 0:
        batch_counter += 1
        random.shuffle(data_indices)
        print(f"\nShuffled Indexes for Batch No. {batch_counter} :{data_indices}")
        print(f"Values for Batch No.{batch_counter} :{[a[index] for index in data_indices]}")

    b.append(a[data_indices[data_index]])
    data_index = (data_index + 1) % a_size

print(f"\nFinal value of b: {b} with {len(b)} items")
#+end_src

#+RESULTS:
: New value order for first batch: [1, 3, 4, 2]
: 
: Shuffled Indexes for Batch No. 2 :[1, 3, 2, 0]
: Values for Batch No.2 :[2, 4, 3, 1]
: 
: Shuffled Indexes for Batch No. 3 :[0, 3, 2, 1]
: Values for Batch No.3 :[1, 4, 3, 2]
: 
: Final value of b: [1, 3, 4, 2, 2, 4, 3, 1, 1, 4] with 10 items

 **Note:** We call an epoch each time that an algorithm passes over all the training examples. Shuffling the examples for each epoch is known to reduce variance, making the models more general and overfit less.

Using sample. instead.

#+begin_src python :results output :exports both
data_indices = random.sample(range(a_size), k=a_size)
b = [a[index] for index in data_indices]
b_size = 10

print(f"New value order for first batch: {b}")
batch_counter = 1
data_index = 0
for b_index in range(len(b), b_size):
    if data_index == 0:
        batch_counter += 1
        data_indices = random.sample(data_indices, k=a_size)
        print(f"\nShuffled Indexes for Batch No. {batch_counter} :{data_indices}")
        print(f"Values for Batch No.{batch_counter} :{[a[index] for index in data_indices]}")

    b.append(a[data_indices[data_index]])
    data_index = (data_index + 1) % a_size

print(f"\nFinal value of b: {b} with {len(b)} items")

#+end_src

#+RESULTS:
: New value order for first batch: [1, 4, 3, 2]
: 
: Shuffled Indexes for Batch No. 2 :[3, 0, 1, 2]
: Values for Batch No.2 :[4, 1, 2, 3]
: 
: Shuffled Indexes for Batch No. 3 :[2, 0, 1, 3]
: Values for Batch No.3 :[3, 1, 2, 4]
: 
: Final value of b: [1, 4, 3, 2, 4, 1, 2, 3, 3, 1] with 10 items
